posts/albert2008.org
#+TITLE:Notes de lectures: Closed-form Upper Bounds in Static Cost Analysis
#+AUTHOR: Hector Suzanne
#+date:<2020-04-06 Mon>
* Introduction

On cherche à borner le coût en une certaine ressource d'un programme /P/ sur une
entrée arbitraire /x/ sans pour autant avoir à déterminer le /x/ qui réalise
cette borne ou avoir à calculer /P(x)/. Pour ce faire, on procède avec un
programme /P/ et un /modèle de coût/ donné. On produit dans un premier temps des
/relations de coûts (CR)/ pour /P/. Ces relations décrivent le coût selon le
modèle du calcul de /P/ en fonction de la /taille/ de son entrée /x/.

Les CR sont un formalisme pertinent pour l'analyse de coût pour les raisons
suivantes:
- Elles sont agnostiques au langage et modèle de coût utilisés
- Elles couvrent de nombreuses classes de complexités algorithmiques, et sont
  donc polyvalentes
- On peut y capturer des notions non-triviales de coûts, même à posteriori en
  changeant le modèle.
La dynamique des CR est néanmoins non-triviale: l'abstraction des données du
programme à leurs tailles crée une source de non-déterminisme: par exemple,
quand on branche selon une valeur du programme, et que les deux branches n'ont
pas de coût égaux, notre analyse statique doit résoudre l'ambiguïté.

Dans la littérature, on utilise souvent des /relations de récurrences/ à la
place des relations de coûts. Cela à conduit à essayer de déléguer la recherche
de formes fermées des relations de coûts par des systèmes experts de calculs
symboliques (Mapple, Mathematica,etc.). Mais, nous le verrons, cette approche na
pas eue la succès escompté.

Notre nouvelle approche, basée sur l'analyse statique d'une sémantique de
programmation par contrainte des CR, est la première permettant d'obtenir des
formes closes des CR automatiquement pour un grand nombre de programmes
impératifs représentatifs de ceux présent dans le monde réel.

* Relations de Coûts

** Obtention

On veut pouvoir inférer, depuis le code source d'un programme impératif
structuré (avec =if=, =while=,...) ou non-structuré (avec =goto=, =jump=) les
relations de tailles qui existent entre les données qu'il manipule. On procède
en trois étapes:
1. On construit les /Control Flow Graph/ du programme pour rendre les
   récurrences explicites.
2. En utilisant l'interprétation abstraite, on obtient des /relation de tailles/
   entres les différents appels récursifs. Les relations obtenues sont
   généralement linéaires (i.e. on travaille dans les domaine abstrait des
   polyèdres convexes), mais on peut utiliser un autre formalisme à condition
   d'avoir un solveur adapté plus loin dans le traitement.
3. On interprète le programme dans le modèle de coût choisi, afin de générer les
   relations de coûts en elles-mêmes.

** Syntaxe

#+BEGIN_SRC
r   ::= ℝ+
n   ::= ℕ
v   ::= Ζ
lin ::= v1*x1 + ... vn*xn
c   ::= lin < lin | lin ≤ lin | lin = lin
φ   ::= c+

exp ::= r         | nat(lin)
      | exp + exp | exp * exp  | exp - r
      | exp ^ r   | log_n(exp) | n^exp
      | max( exp+ )

cost ::=  C(x1...xn) = exp + ∑(i=1...n) D_i(yi1...yim) where φ
CRS  ::= cost+
#+END_SRC

On notera que dans =cost=, les variables de =exp= et =y1..ym= ne sont pas
/définies/ grâce à =x1...xn=, mais seulement reliées à elles par les contraintes
présentes dans =φ=.

** Sémantique

La sémantique des /CRS/ suit celle d'un programme en progammation logique par
contrainte: Pour évaluer un =C(v1...vn)=, on procède par étape:
1. On choisie une des clauses du CRS qui a =C= en tête.
2. on instancie les variables =x1...xn, yi1...yim, vars(exp)= de manière à
   satisfaire =φ=.
3. On calcule et accumule =exp= sous l'instanciation précédente
4. On itère sur tout les =D_i=
Quand on ne peut pas satisfaire =φ=, on a atteint un échec.
La sémantique est parallèle à celle d'un programme Prolog.

On définit alors la sémantique d'un CRS comme l'ensemble de arbres d'évaluations
qu'il engendre. Le coût d'un arbre est défini par induction, et le coût du CRS
l'ensemble des coût que ses arbres d'évaluation.

On note =Trees(C(v1...vn), S)= l'ensemble des arbres de l'évaluation de
=C(v1...vn)= dans le CRS =S=, et =Answer(C(v1...vn), S)= l'ensemble des coûts
engendrés.

** Comparaison avec des RR

- Non-déterminisme :: L'abstraction des valeurs par leurs tailles rends les CR
  /très/ non-déterministes, même dans les cas ou le programme ne l'est pas. Voir
  par exemple la fonction =filter=.
- Contraintes inexactes :: Les arguments des appels récursifs des CR ne sont
  liées aux arguments à la racine que par des relations imprécises. On peut
  avoir à les tirer dans les ensembles infinis. Dans les RR, les arguments des
  appels récursifs sont connus si on connaît les arguments de l'appel précédent.
- Arguments multiples :: Dans les RR, l'argument décroît selon un ordre bien
  fondé, ce qui garantie la terminaison: on parle de récurrence structurelle.
  Dans les CR, l'ordre bien-fondé peut exister sur une /relation de taille/
  arbitraire.

  Les deux premiers cas sont une source importante de non-déterminisme du
  résultat. Les CR ne définissent pas des fonctions mais des relations entre les
  tailles des arguments et la "taille" du calcul associé. De plus, les systèmes
  experts de résolutions de récurrence ne peuvent généralement par inférer seuls
  l'argument décroissant de manière bien-fondé nécessaire à la résolution de la
  récurrence. Ces systèmes ne sont pas adaptés à la mise en forme close de CR.

  On pourrait, enfin essayer de simplifier les CR pour en retirer le
  non-déterminisme. Hélas, les exemples réels simples montrent sans ambiguïté
  qu'il existe des CR non-déterministes dont la borne sup n'est pas modélisable
  par celle d'une de ses sous-CR déterministe.

* Bornes Supérieures de Forme Fermées des Relations de Coûts

On définit les /Bornes Supérieures de =C= de formes fermées dans un CRS/ =S=
comme une fonction =f : Ζ^n -> ℝ+= telle que:
- =f(x1...xn) = exp=
- =∀ v1...vn, ∀r ∈ Answers(C(v1...vn), S), f(v1...vn) ≥ r=

La méthode décrite dans l'article construit les bornes sup =f= en approchant par
le haut le nombre et le coût individuel des noeuds internes et des feuilles des
arbres d'évaluation de =C=. Formellement:

=f(x) = internes(x)*cout-interne(x) + feuilles(x)*cout-feuille(x)=

