stage/albert2008.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-07 Tue 12:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes de lectures: Closed-form Upper Bounds in Static Cost Analysis</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="content">
<div id="outline-container-orgd12e518" class="outline-2">
<h2 id="orgd12e518">Introduction</h2>
<div class="outline-text-2" id="text-orgd12e518">
<p>
On cherche à borner le coût en une certaine ressource d&rsquo;un programme <i>P</i> sur une
entrée arbitraire <i>x</i> sans pour autant avoir à déterminer le <i>x</i> qui réalise
cette borne ou avoir à calculer <i>P(x)</i>. Pour ce faire, on procède avec un
programme <i>P</i> et un <i>modèle de coût</i> donné. On produit dans un premier temps des
<i>relations de coûts (CR)</i> pour <i>P</i>. Ces relations décrivent le coût selon le
modèle du calcul de <i>P</i> en fonction de la <i>taille</i> de son entrée <i>x</i>.
</p>

<p>
Les CR sont un formalisme pertinent pour l&rsquo;analyse de coût pour les raisons
suivantes:
</p>
<ul class="org-ul">
<li>Elles sont agnostiques au langage et modèle de coût utilisés</li>
<li>Elles couvrent de nombreuses classes de complexités algorithmiques, et sont
donc polyvalentes</li>
<li>On peut y capturer des notions non-triviales de coûts, même à posteriori en
changeant le modèle.</li>
</ul>
<p>
La dynamique des CR est néanmoins non-triviale: l&rsquo;abstraction des données du
programme à leurs tailles crée une source de non-déterminisme: par exemple,
quand on branche selon une valeur du programme, et que les deux branches n&rsquo;ont
pas de coût égaux, notre analyse statique doit résoudre l&rsquo;ambiguïté.
</p>

<p>
Dans la littérature, on utilise souvent des <i>relations de récurrences</i> à la
place des relations de coûts. Cela à conduit à essayer de déléguer la recherche
de formes fermées des relations de coûts par des systèmes experts de calculs
symboliques (Mapple, Mathematica,etc.). Mais, nous le verrons, cette approche na
pas eue la succès escompté.
</p>

<p>
Notre nouvelle approche, basée sur l&rsquo;analyse statique d&rsquo;une sémantique de
programmation par contrainte des CR, est la première permettant d&rsquo;obtenir des
formes closes des CR automatiquement pour un grand nombre de programmes
impératifs représentatifs de ceux présent dans le monde réel.
</p>
</div>
</div>

<div id="outline-container-orge104381" class="outline-2">
<h2 id="orge104381">Relations de Coûts</h2>
<div class="outline-text-2" id="text-orge104381">
</div>
<div id="outline-container-org2cce947" class="outline-3">
<h3 id="org2cce947">Obtention</h3>
<div class="outline-text-3" id="text-org2cce947">
<p>
On veut pouvoir inférer, depuis le code source d&rsquo;un programme impératif
structuré (avec <code>if</code>, <code>while</code>,&#x2026;) ou non-structuré (avec <code>goto</code>, <code>jump</code>) les
relations de tailles qui existent entre les données qu&rsquo;il manipule. On procède
en trois étapes:
</p>
<ol class="org-ol">
<li>On construit les <i>Control Flow Graph</i> du programme pour rendre les
récurrences explicites.</li>
<li>En utilisant l&rsquo;interprétation abstraite, on obtient des <i>relation de tailles</i>
entres les différents appels récursifs. Les relations obtenues sont
généralement linéaires (i.e. on travaille dans les domaine abstrait des
polyèdres convexes), mais on peut utiliser un autre formalisme à condition
d&rsquo;avoir un solveur adapté plus loin dans le traitement.</li>
<li>On interprète le programme dans le modèle de coût choisi, afin de générer les
relations de coûts en elles-mêmes.</li>
</ol>
</div>
</div>

<div id="outline-container-orga8980bc" class="outline-3">
<h3 id="orga8980bc">Syntaxe</h3>
<div class="outline-text-3" id="text-orga8980bc">
<pre class="example">
r   ::= ℝ+
n   ::= ℕ
v   ::= Ζ
lin ::= v1*x1 + ... vn*xn
c   ::= lin &lt; lin | lin ≤ lin | lin = lin
φ   ::= c+

exp ::= r         | nat(lin)
      | exp + exp | exp * exp  | exp - r
      | exp ^ r   | log_n(exp) | n^exp
      | max( exp+ )

cost ::=  C(x1...xn) = exp + ∑(i=1...n) D_i(yi1...yim) where φ
CRS  ::= cost+
</pre>

<p>
On notera que dans <code>cost</code>, les variables de <code>exp</code> et <code>y1..ym</code> ne sont pas
<i>définies</i> grâce à <code>x1...xn</code>, mais seulement reliées à elles par les contraintes
présentes dans <code>φ</code>.
</p>
</div>
</div>

<div id="outline-container-org3686d69" class="outline-3">
<h3 id="org3686d69">Sémantique</h3>
<div class="outline-text-3" id="text-org3686d69">
<p>
La sémantique des <i>CRS</i> suit celle d&rsquo;un programme en progammation logique par
contrainte: Pour évaluer un <code>C(v1...vn)</code>, on procède par étape:
</p>
<ol class="org-ol">
<li>On choisie une des clauses du CRS qui a <code>C</code> en tête.</li>
<li>on instancie les variables <code>x1...xn, yi1...yim, vars(exp)</code> de manière à
satisfaire <code>φ</code>.</li>
<li>On calcule et accumule <code>exp</code> sous l&rsquo;instanciation précédente</li>
<li>On itère sur tout les <code>D_i</code></li>
</ol>
<p>
Quand on ne peut pas satisfaire <code>φ</code>, on a atteint un échec.
La sémantique est parallèle à celle d&rsquo;un programme Prolog.
</p>

<p>
On définit alors la sémantique d&rsquo;un CRS comme l&rsquo;ensemble de arbres d&rsquo;évaluations
qu&rsquo;il engendre. Le coût d&rsquo;un arbre est défini par induction, et le coût du CRS
l&rsquo;ensemble des coût que ses arbres d&rsquo;évaluation.
</p>

<p>
On note <code>Trees(C(v1...vn), S)</code> l&rsquo;ensemble des arbres de l&rsquo;évaluation de
<code>C(v1...vn)</code> dans le CRS <code>S</code>, et <code>Answer(C(v1...vn), S)</code> l&rsquo;ensemble des coûts
engendrés.
</p>
</div>
</div>

<div id="outline-container-org99bad3e" class="outline-3">
<h3 id="org99bad3e">Comparaison avec des RR</h3>
<div class="outline-text-3" id="text-org99bad3e">
<dl class="org-dl">
<dt>Non-déterminisme</dt><dd>L&rsquo;abstraction des valeurs par leurs tailles rends les CR
<i>très</i> non-déterministes, même dans les cas ou le programme ne l&rsquo;est pas. Voir
par exemple la fonction <code>filter</code>.</dd>
<dt>Contraintes inexactes</dt><dd>Les arguments des appels récursifs des CR ne sont
liées aux arguments à la racine que par des relations imprécises. On peut
avoir à les tirer dans les ensembles infinis. Dans les RR, les arguments des
appels récursifs sont connus si on connaît les arguments de l&rsquo;appel précédent.</dd>
<dt>Arguments multiples</dt><dd><p>
Dans les RR, l&rsquo;argument décroît selon un ordre bien
fondé, ce qui garantie la terminaison: on parle de récurrence structurelle.
Dans les CR, l&rsquo;ordre bien-fondé peut exister sur une <i>relation de taille</i>
arbitraire.
</p>

<p>
Les deux premiers cas sont une source importante de non-déterminisme du
résultat. Les CR ne définissent pas des fonctions mais des relations entre les
tailles des arguments et la &ldquo;taille&rdquo; du calcul associé. De plus, les systèmes
experts de résolutions de récurrence ne peuvent généralement par inférer seuls
l&rsquo;argument décroissant de manière bien-fondé nécessaire à la résolution de la
récurrence. Ces systèmes ne sont pas adaptés à la mise en forme close de CR.
</p>

<p>
On pourrait, enfin essayer de simplifier les CR pour en retirer le
non-déterminisme. Hélas, les exemples réels simples montrent sans ambiguïté
qu&rsquo;il existe des CR non-déterministes dont la borne sup n&rsquo;est pas modélisable
par celle d&rsquo;une de ses sous-CR déterministe.
</p></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgc9771b3" class="outline-2">
<h2 id="orgc9771b3">Bornes Supérieures de Forme Fermées des Relations de Coûts</h2>
<div class="outline-text-2" id="text-orgc9771b3">
<p>
On définit les <i>Bornes Supérieures de <code>C</code> de formes fermées dans un CRS</i> <code>S</code>
comme une fonction <code>f : Ζ^n -&gt; ℝ+</code> telle que:
</p>
<ul class="org-ul">
<li><code>f(x1...xn) = exp</code></li>
<li><code>∀ v1...vn, ∀r ∈ Answers(C(v1...vn), S), f(v1...vn) ≥ r</code></li>
</ul>

<p>
La méthode décrite dans l&rsquo;article construit les bornes sup <code>f</code> en approchant par
le haut le nombre et le coût individuel des noeuds internes et des feuilles des
arbres d&rsquo;évaluation de <code>C</code>. Formellement:
</p>

<p>
<code>f(x) = internes(x)*cout-interne(x) + feuilles(x)*cout-feuille(x)</code>
</p>
</div>
