posts/albert2008.org
** Bornage du Nombre de Noeuds

On borne les valeurs de =internes(x)= et =feuilles(x)= en donnant une borne supérieure
de la hauteur =h(x)= et du /facteur de branchement/ =b= des arbres d'évaluation.
Le facteur de branchement est facilement borné par le nombre maximal d'appels
récursifs dans une équation pour =C=. Il est donc immédiatement calculable.

On cherche maintenant à borner, pour un arbre d'évaluation =T ∈
Trees(C(v1...vn), S)=. On applique un pré-traitement à =S= pour garantir un
invariant sur =T=: C'est la /Mise en forme de récurrence directe/: Dans une
descente dans =T=, les noeuds successifs représentent des appels imbriqués aux
relations de coût idoines, étiquetés par les têtes des relations (=C=, =D=,
...); La forme de récurrence directe impose que si =C= apparaît comme un
descendant de =C=, alors c'est un descendant direct. Ce résultat permet de
réduire le bornage de =h(x)= au bornage du nombre d'appels successifs à une
relation de coût =C=. Une technique de passage en forme de récurrence directe
est présentée plus loin.

Le bornage du nombre d'appel successifs à une relation de coût ou de récurrence
à été étudié dans le cadre de l'analyse de terminaison, aussi il existe des
algorithmes d'inférence de /fonctions de classement/, qui associe aux arguments
des relations un /rang/ dans un ordre bien-fondé. Si une fonction de classement
=f_C= existe pour une relation de coût =C=, alors la hauteur de l'arbre engendré
par =C(v1...vn)= est bornée =f_C(v1...vn)=. Les fonctions de classements que
nous utilisons sont linéaires, et inférées par l'algorithme décrit par Podelski
& Rybalchenko dans /A complete method for the for synthesis of linear ranking
functions (VMCAI04)/.

Une fois les bornes de la hauteur est du facteur de branchement établie, il
suffit d'approximer l'arbre d'évaluation par un arbre complet de hauteur
=h(v1...vn)= et de facteur =b=.

** Bornage du Coût par Noeud

Il reste maintenant à obtenir les fonctions =cout-interne= et =cout-feuille=.
Premièrement, on utilise l'interprétation abstraite sur la forme de récurrence
directe pour obtenir des approximations sûres des invariants entre les appels
successifs aux relations de coûts. Les coûts sont monotones en leurs composants
=nat=. Ils suffit alors de borner ces composants en utilisant les invariants
calculés plus haut et les arguments à la racine de l'arbre d'évaluation. (Voir
la functions =ub_exp= de l'article original pour le code exact). Les relations
de coûts récursives de =S= engendrent les noeuds internes, et les non-récursives
engendrent les feuilles. Les bornes supérieures calculées ici forment les
fonctions =cout-interne= et =cout-feuille=.

** Cas des Algorithmes /Diviser-pour-régner/

Dans les cas des algorithmes diviser-pour-régner, l'approximation
noeud-par-noeud n'est pas assez précise. On borne alors le coût d'une relation
de coût =C= par =C+(x) = levels(x)*cout-level(x)=. Comme précédemment, on borne
de nombre de niveau avec la hauteur de l'arbre.

Pour borner le coût par niveau, nous développons une caractérisation des CR
/diviser-pour-régner/ compatible avec notre analyse, un test automatique
d'appartenance à cette classe de CR, et une méthode pour calculer une borne
=cout-level= pour ces CR.

- Caractérisation :: Une CR est /diviser-pour-régner/ si, pour tout ses arbres
  d'évaluation, le coût propre d'un niveau de son arbre d'évaluation des
  supérieur ou égal au coût propre du niveau directement en dessous
- Calcul :: On calcule, pour une CR =C=, les paires des coûts abstraits propres
  de chaque équation définissant =C= et de la somme des coût abstraits propres
  de leurs enfants respectif. Pour prouver que =C= est diviser-pour-régner, il
  suffit de prouver que pour tout assignement satisfaisant les contraintes
  locales à ces noeuds, le coût de =C= est au moins égal au coût total de ces
  enfants.
- Bornage :: On borne alors le coût d'un niveau par le coût de la racine, qui
  est le niveau de coût maximal. L'algorithme de calcul est le même que pour le
  calcul de =cout-interne=.

* Mise en Forme de Récurrence Directe des Relations de Coûts

*TODO* On a rien compris à leurs définition maître de "BTC". En même temps ils
pourrait la définir proprement. Mgr. Gigard aurait eu des mots durs sur cette
partie.

Mais, en gros, il s'agit de déterminer, par une analyse de composante fortement
connexe dans le CFG des système de CR, lesquelles sont définies récursivement et
le cas échéant d'effectuer assez l'inlining pour rendre toutes les définitions
récursives /directement/ récursives.

* Incomplétude de l'Analyse de Coût

La terminaison de programme peut se réduire à un calcul de coût dans un modèle.
Donc notre analyse sera forcément incomplète. Même quand un programme admet un
coût fini dans le modèle considéré, notre analyse comporte des sources de pertes
de précision:
- La transformation du programme en système de relations de coût utilise des
  techniques d'interprétation abstraites qui donnent des résultats approximatifs
  sur des problèmes comme l'aliasing ou les relations de tailles. On notera que
  certain de ces problèmes sont en soit indécidables.
- L'obtention de bornes supérieures pour les systèmes de CR est aussi
  indécidable, même pour des systèmes appauvris. On distingue les pertes de
  précisions suivantes dans notes analyse :
  - La mise en forme de récurrence directe n'est pas systématiquement faisable,
    notamment dans le cas de définition mutuellement récursives.
  - Certaines CR n'ont pas de fonction de classement linéaires. On pourrait
    étendre nos fonctions de classement à des classes plus expressives, mais le
    besoin ne s'est pas fait ressentir en pratique.
  - Les invariants recherchés lors du bornage du coût par noeud peuvent ne pas
    être linéaires. Pour intégrer des classes d'invariants plus intéressantes,
    il conviendrait d'adapter la procédure de maximisation.

* Évaluation Expérimentale

*TODO*

