stage/albert2008.html

<div id="outline-container-org6253d41" class="outline-3">
<h3 id="org6253d41">Bornage du Nombre de Noeuds</h3>
<div class="outline-text-3" id="text-org6253d41">
<p>
On borne les valeurs de <code>internes(x)</code> et <code>feuilles(x)</code> en donnant une borne supérieure
de la hauteur <code>h(x)</code> et du <i>facteur de branchement</i> <code>b</code> des arbres d&rsquo;évaluation.
Le facteur de branchement est facilement borné par le nombre maximal d&rsquo;appels
récursifs dans une équation pour <code>C</code>. Il est donc immédiatement calculable.
</p>

<p>
On cherche maintenant à borner, pour un arbre d&rsquo;évaluation <code>T ∈
Trees(C(v1...vn), S)</code>. On applique un pré-traitement à <code>S</code> pour garantir un
invariant sur <code>T</code>: C&rsquo;est la <i>Mise en forme de récurrence directe</i>: Dans une
descente dans <code>T</code>, les noeuds successifs représentent des appels imbriqués aux
relations de coût idoines, étiquetés par les têtes des relations (<code>C</code>, <code>D</code>,
&#x2026;); La forme de récurrence directe impose que si <code>C</code> apparaît comme un
descendant de <code>C</code>, alors c&rsquo;est un descendant direct. Ce résultat permet de
réduire le bornage de <code>h(x)</code> au bornage du nombre d&rsquo;appels successifs à une
relation de coût <code>C</code>. Une technique de passage en forme de récurrence directe
est présentée plus loin.
</p>

<p>
Le bornage du nombre d&rsquo;appel successifs à une relation de coût ou de récurrence
à été étudié dans le cadre de l&rsquo;analyse de terminaison, aussi il existe des
algorithmes d&rsquo;inférence de <i>fonctions de classement</i>, qui associe aux arguments
des relations un <i>rang</i> dans un ordre bien-fondé. Si une fonction de classement
<code>f_C</code> existe pour une relation de coût <code>C</code>, alors la hauteur de l&rsquo;arbre engendré
par <code>C(v1...vn)</code> est bornée <code>f_C(v1...vn)</code>. Les fonctions de classements que
nous utilisons sont linéaires, et inférées par l&rsquo;algorithme décrit par Podelski
&amp; Rybalchenko dans <i>A complete method for the for synthesis of linear ranking
functions (VMCAI04)</i>.
</p>

<p>
Une fois les bornes de la hauteur est du facteur de branchement établie, il
suffit d&rsquo;approximer l&rsquo;arbre d&rsquo;évaluation par un arbre complet de hauteur
<code>h(v1...vn)</code> et de facteur <code>b</code>.
</p>
</div>
</div>

<div id="outline-container-org77d4bab" class="outline-3">
<h3 id="org77d4bab">Bornage du Coût par Noeud</h3>
<div class="outline-text-3" id="text-org77d4bab">
<p>
Il reste maintenant à obtenir les fonctions <code>cout-interne</code> et <code>cout-feuille</code>.
Premièrement, on utilise l&rsquo;interprétation abstraite sur la forme de récurrence
directe pour obtenir des approximations sûres des invariants entre les appels
successifs aux relations de coûts. Les coûts sont monotones en leurs composants
<code>nat</code>. Ils suffit alors de borner ces composants en utilisant les invariants
calculés plus haut et les arguments à la racine de l&rsquo;arbre d&rsquo;évaluation. (Voir
la functions <code>ub_exp</code> de l&rsquo;article original pour le code exact). Les relations
de coûts récursives de <code>S</code> engendrent les noeuds internes, et les non-récursives
engendrent les feuilles. Les bornes supérieures calculées ici forment les
fonctions <code>cout-interne</code> et <code>cout-feuille</code>.
</p>
</div>
</div>

<div id="outline-container-org1bf694a" class="outline-3">
<h3 id="org1bf694a">Cas des Algorithmes <i>Diviser-pour-régner</i></h3>
<div class="outline-text-3" id="text-org1bf694a">
<p>
Dans les cas des algorithmes diviser-pour-régner, l&rsquo;approximation
noeud-par-noeud n&rsquo;est pas assez précise. On borne alors le coût d&rsquo;une relation
de coût <code>C</code> par <code>C+(x) = levels(x)*cout-level(x)</code>. Comme précédemment, on borne
de nombre de niveau avec la hauteur de l&rsquo;arbre.
</p>

<p>
Pour borner le coût par niveau, nous développons une caractérisation des CR
<i>diviser-pour-régner</i> compatible avec notre analyse, un test automatique
d&rsquo;appartenance à cette classe de CR, et une méthode pour calculer une borne
<code>cout-level</code> pour ces CR.
</p>

<dl class="org-dl">
<dt>Caractérisation</dt><dd>Une CR est <i>diviser-pour-régner</i> si, pour tout ses arbres
d&rsquo;évaluation, le coût propre d&rsquo;un niveau de son arbre d&rsquo;évaluation des
supérieur ou égal au coût propre du niveau directement en dessous</dd>
<dt>Calcul</dt><dd>On calcule, pour une CR <code>C</code>, les paires des coûts abstraits propres
de chaque équation définissant <code>C</code> et de la somme des coût abstraits propres
de leurs enfants respectif. Pour prouver que <code>C</code> est diviser-pour-régner, il
suffit de prouver que pour tout assignement satisfaisant les contraintes
locales à ces noeuds, le coût de <code>C</code> est au moins égal au coût total de ces
enfants.</dd>
<dt>Bornage</dt><dd>On borne alors le coût d&rsquo;un niveau par le coût de la racine, qui
est le niveau de coût maximal. L&rsquo;algorithme de calcul est le même que pour le
calcul de <code>cout-interne</code>.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org0d6e1bf" class="outline-2">
<h2 id="org0d6e1bf">Mise en Forme de Récurrence Directe des Relations de Coûts</h2>
<div class="outline-text-2" id="text-org0d6e1bf">
<p>
<b>TODO</b> On a rien compris à leurs définition maître de &ldquo;BTC&rdquo;. En même temps ils
pourrait la définir proprement. Mgr. Gigard aurait eu des mots durs sur cette
partie.
</p>

<p>
Mais, en gros, il s&rsquo;agit de déterminer, par une analyse de composante fortement
connexe dans le CFG des système de CR, lesquelles sont définies récursivement et
le cas échéant d&rsquo;effectuer assez l&rsquo;inlining pour rendre toutes les définitions
récursives <i>directement</i> récursives.
</p>
</div>
</div>

<div id="outline-container-org0863e3b" class="outline-2">
<h2 id="org0863e3b">Incomplétude de l&rsquo;Analyse de Coût</h2>
<div class="outline-text-2" id="text-org0863e3b">
<p>
La terminaison de programme peut se réduire à un calcul de coût dans un modèle.
Donc notre analyse sera forcément incomplète. Même quand un programme admet un
coût fini dans le modèle considéré, notre analyse comporte des sources de pertes
de précision:
</p>
<ul class="org-ul">
<li>La transformation du programme en système de relations de coût utilise des
techniques d&rsquo;interprétation abstraites qui donnent des résultats approximatifs
sur des problèmes comme l&rsquo;aliasing ou les relations de tailles. On notera que
certain de ces problèmes sont en soit indécidables.</li>
<li>L&rsquo;obtention de bornes supérieures pour les systèmes de CR est aussi
indécidable, même pour des systèmes appauvris. On distingue les pertes de
précisions suivantes dans notes analyse :
<ul class="org-ul">
<li>La mise en forme de récurrence directe n&rsquo;est pas systématiquement faisable,
notamment dans le cas de définition mutuellement récursives.</li>
<li>Certaines CR n&rsquo;ont pas de fonction de classement linéaires. On pourrait
étendre nos fonctions de classement à des classes plus expressives, mais le
besoin ne s&rsquo;est pas fait ressentir en pratique.</li>
<li>Les invariants recherchés lors du bornage du coût par noeud peuvent ne pas
être linéaires. Pour intégrer des classes d&rsquo;invariants plus intéressantes,
il conviendrait d&rsquo;adapter la procédure de maximisation.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge024f83" class="outline-2">
<h2 id="orge024f83">Évaluation Expérimentale</h2>
<div class="outline-text-2" id="text-orge024f83">
<p>
<b>TODO</b>
</p>
</div>
</div>
