posts/albert2008.org
* Travaux Connexes & Conclusion

Dès le système /METRIC/ de Wegbriet, on cherche à obtenir des CR à partir de
programme. Mais /METRIC/ se limite aux RR, qui sont déterministes, et déjà, les
solution exactes sous formes closes sont ors de portée. On se contente alors de
bornes supérieures. On retrouve ensuite les travaux de Métayer avec /ACE/, de
Rosenthal avec l'interprétation abstraite, de Walder avec l'analyse de rigueur
au service de l'analyse de ressources, et Sands et ses théories d'équivalence de
coûts. Notre avancée consiste à considérer des relations (1) non-déterministes,
(2) augmentées de contraintes de tailles sur leurs arguments.

Les systèmes *algébriques* sont basés sur les travaux extensifs sur la
résolution de relations de récurrences, soit en implémentant un solveur limité
en tant que composant de l'analyseur, soit en déléguant la résolution à un
/Computer Algebra System/. On citera /Mathematica, Mapple, Maxima/...

Les systèmes *transformationnels* représentent les CR comme des programmes
fonctionnels, et la mise en forme close correspond à une réécriture du programme
de base augmenté d'une notion de consommation de ressource. /ACE/ fût le premier
de ces systéme, basé sur une grande quantité de règles de réécriture manuelles.
Depuis, des avancées ont permis de trouver des bornes sous forme close pour
certaines classes de programmes (cf. Rosenthal FPCA'89).

Les deux approches souffrent de problèmes en cas de non-déterminisme des CR, ce
qui est assez courant dans le monde réel, et les résultats obtenus sont rarement
utiles s'il sont trop coûteux ou trop précis, et donc algébriquement complexes
(que faire de 5*sqrt(5)*(1-sqrt(5))^(x+1) - 5*sqrt(5)*(1+sqrt(5))^(x+1) + ... ?)
Au contraire, l'approche décrite dans cette article produit des résultats
corrects et simple même en cas de non-déterminisme.

On note l'existence de /PURRS/, qui ressemble à notre travail, mais avec
uniquement des CR déterministes, et des travaux de Marion&al. sur les bornes
polynomiales des tailles de piles pour les programmes fonctionnels.

Notre travail mets en lumière la pertinence des CR comme /langage cible/ des
analyses de coûts pour une analyse agnostique du langage source. Nous avons
étendu notre travail à des CR prenant en compte les phénomènes de libération
mémoire par un ramasse-miette, et donc le bornage de tas.
