stage/albert2008.html

<div id="outline-container-org377a997" class="outline-2">
<h2 id="org377a997">Travaux Connexes &amp; Conclusion</h2>
<div class="outline-text-2" id="text-org377a997">
<p>
Dès le système <i>METRIC</i> de Wegbriet, on cherche à obtenir des CR à partir de
programme. Mais <i>METRIC</i> se limite aux RR, qui sont déterministes, et déjà, les
solution exactes sous formes closes sont ors de portée. On se contente alors de
bornes supérieures. On retrouve ensuite les travaux de Métayer avec <i>ACE</i>, de
Rosenthal avec l&rsquo;interprétation abstraite, de Walder avec l&rsquo;analyse de rigueur
au service de l&rsquo;analyse de ressources, et Sands et ses théories d&rsquo;équivalence de
coûts. Notre avancée consiste à considérer des relations (1) non-déterministes,
(2) augmentées de contraintes de tailles sur leurs arguments.
</p>

<p>
Les systèmes <b>algébriques</b> sont basés sur les travaux extensifs sur la
résolution de relations de récurrences, soit en implémentant un solveur limité
en tant que composant de l&rsquo;analyseur, soit en déléguant la résolution à un
<i>Computer Algebra System</i>. On citera <i>Mathematica, Mapple, Maxima</i>&#x2026;
</p>

<p>
Les systèmes <b>transformationnels</b> représentent les CR comme des programmes
fonctionnels, et la mise en forme close correspond à une réécriture du programme
de base augmenté d&rsquo;une notion de consommation de ressource. <i>ACE</i> fût le premier
de ces systéme, basé sur une grande quantité de règles de réécriture manuelles.
Depuis, des avancées ont permis de trouver des bornes sous forme close pour
certaines classes de programmes (cf. Rosenthal FPCA&rsquo;89).
</p>

<p>
Les deux approches souffrent de problèmes en cas de non-déterminisme des CR, ce
qui est assez courant dans le monde réel, et les résultats obtenus sont rarement
utiles s&rsquo;il sont trop coûteux ou trop précis, et donc algébriquement complexes
(que faire de 5*sqrt(5)*(1-sqrt(5))<sup>(x+1)</sup> - 5*sqrt(5)*(1+sqrt(5))<sup>(x+1)</sup> + &#x2026; ?)
Au contraire, l&rsquo;approche décrite dans cette article produit des résultats
corrects et simple même en cas de non-déterminisme.
</p>

<p>
On note l&rsquo;existence de <i>PURRS</i>, qui ressemble à notre travail, mais avec
uniquement des CR déterministes, et des travaux de Marion&amp;al. sur les bornes
polynomiales des tailles de piles pour les programmes fonctionnels.
</p>

<p>
Notre travail mets en lumière la pertinence des CR comme <i>langage cible</i> des
analyses de coûts pour une analyse agnostique du langage source. Nous avons
étendu notre travail à des CR prenant en compte les phénomènes de libération
mémoire par un ramasse-miette, et donc le bornage de tas.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-04-07 Tue 12:48</p>
</div>
</body>
</html>
